{
  "summary_reco": " Today: With 3,698 vehicles, traffic is congested on C-4 Road. Consider using alternative routes or means of transportation to reach your destination more smoothly.\n\nThis week: With a total of 25,889 vehicles, C-4 Road is expected to be busy. If possible, adjust your travel time to avoid peak hours or consider alternative modes of transport.\n\nThree months: With 332,874 vehicles, anticipate congestion on C-4 Road. Plan your trips ahead by choosing alternative routes, traveling outside peak hours, or utilizing public transportation to ensure a more efficient journey.",
  "hourly_reco": " Peak Hour:\n- Due to high vehicle traffic on C-4 Road at 08:00, consider using alternative routes or adjusting your travel time to avoid congestion.\n\nLowest Hour:\n- C-4 Road has moderate traffic at 19:00. You can expect a smoother commute during this time.\n\nAverage Vehicles:\n- With an average of 153 vehicles on C-4 Road, it is recommended to consider possible traffic fluctuations and plan your journey accordingly. In general, using real-time traffic updates and being prepared for moderate traffic conditions will help ensure a more efficient commute.",
  "daily_reco": " Peak: With 3,765 vehicles, expect heavy traffic on C-4 Road. Consider using alternative routes or public transportation.\n\nLowest: Even on the day with 3,642 vehicles, C-4 Road in Barangay Longos can still be congested. It's better to plan your trip ahead and leave early to avoid peak hours.\n\nAverage: With an average of 3,698 vehicles, C-4 Road can experience heavy traffic. To save time, explore alternative modes of transportation or adjust your schedule to avoid peak travel times.",
  "weekly_reco": " Peak Week:\nDuring high traffic volume, consider using alternative routes or adjusting travel times to avoid congestion.\n\nLowest Week:\nDespite lower traffic volume, still expect some congestion. To maximize travel efficiency, consider exploring alternative routes or modes of transportation.\n\nAverage Vehicles per Week:\nWhen using C-4 Road in Malabon City, anticipate moderate traffic conditions. Plan your route and travel time accordingly to optimize your commute by using alternative routes when feasible or traveling during off-peak hours.",
  "monthly_reco": " Peak: With high traffic volume, consider alternative routes or adjust your travel time to avoid congestion.\n\nLowest: Despite lower traffic volume, still expect some congestion. Plan your route and allow for extra travel time.\n\nAverage: With consistent traffic volume, use proper route planning and allow for typical travel time to ensure a smooth commute."
}