{
  "summary_reco": " Today: With a high volume of vehicles, seek alternative routes to avoid congestion.\n\nThis week: Anticipate heavy traffic with the high volume of vehicles. Plan to travel during less busy times or consider using alternative routes.\n\nThree months: Prepare for significant vehicle volume during this period. To ensure smoother commutes, explore alternative transportation methods, carpooling, or using public transportation. Adjust your schedule to avoid peak traffic hours if possible.",
  "hourly_reco": " Peak Hour:\n- Consider using alternate routes to avoid heavy traffic, or start your journey earlier to reach your destination on time.\n\nLowest Hour:\n- C-4 Road remains a good option with less traffic, making your commute more convenient and faster.\n\nAverage Vehicles:\n- With consistent traffic, plan your journey accordingly. Leave with some extra time to account for potential delays, or still consider alternate routes for a smoother commute.",
  "daily_reco": " Peak: With 3,765 vehicles, expect heavy traffic on C-4 Road. Consider using alternative routes or plan your travel during off-peak hours.\n\nLowest: Even with 3,642 vehicles, C-4 Road in Barangay Longos remains congested. Look for alternate routes or modes of transportation to avoid delays.\n\nAverage: With an average of 3,698 vehicles, traffic congestion is prevalent on C-4 Road in Malabon City. Utilize public transportation or consider biking as an alternative to reduce the number of vehicles on the road.",
  "weekly_reco": " Peak Week:\nTo avoid congestion on C-4 Road during peak weeks, consider using alternate routes or adjusting your travel time to earlier in the day.\n\nLowest Week:\nEven during low volume weeks, it's still recommended to be prepared for potential congestion on C-4 Road in Malabon City. Use real-time traffic updates to plan your route.\n\nAverage Vehicles per Week:\nFor an average week on C-4 Road, consider leaving earlier to avoid possible congestion. Stay informed about real-time traffic conditions to help ensure a smoother commute.",
  "monthly_reco": " Peak: With high traffic expected on C-4 Road in July, consider carpooling or using public transportation to reduce the number of vehicles on the road. Alternatively, consider traveling during off-peak hours.\n\nLowest: Even though traffic is lighter in February, still expect congestion on C-4 Road. Plan your trips ahead and consider using real-time traffic updates to avoid delays.\n\nAverage: With over 100,000 vehicles per month, C-4 Road can be congested. To save time and reduce stress, consider using alternative routes, traveling during off-peak hours, or using public transportation."
}