{
  "summary_reco": " Today: With 3,631 vehicles, traffic is congested. Try using public transportation or find alternative routes to avoid delays.\n\nThis week: With a total of 25,172 vehicles, expect heavy traffic. Consider carpooling or traveling during off-peak hours to reduce congestion.\n\nThree months: With 332,874 vehicles, it's essential to plan your trips. Use navigation apps for real-time traffic updates, and consider biking or public transport for shorter distances.",
  "hourly_reco": " Peak hour (08:00):\n- Consider using alternate routes to avoid heavy traffic, or start your journey earlier to arrive at your destination on time.\n\nAverage vehicles (150):\n- Monitor traffic conditions throughout the day, as vehicle volume can change. Prepare for potential congestion during peak hours.\n\nLowest hour (19:00):\n- If possible, plan your trips during these hours to experience lower traffic volumes, making your journey more efficient and convenient.",
  "daily_reco": " Peak day (August 9, 3,656 vehicles): \"Anticipate heavy traffic on C-4 Road on this day. Consider using alternative routes or adjusting your travel time to avoid congestion.\"\n\nLowest day (August 4, 3,527 vehicles): \"C-4 Road is likely to have regular traffic for today. Still, it's a good idea to stay informed about real-time traffic updates.\"\n\nAverage vehicles per day (3,595): \"Expect moderate traffic on C-4 Road, as daily vehicle volume averages around 3,595. Stay updated on traffic conditions to plan your journey accordingly.\"",
  "weekly_reco": " Peak week: With high traffic volume during 2025-09-15 to 2",
  "monthly_reco": " Peak: With high traffic expected, consider alternative routes or adjust your travel time to avoid congestion.\n\nLowest: Despite being the month with fewer vehicles, still expect some level of congestion. Plan your journey accordingly and allow extra travel time.\n\nAverage: With consistent traffic volume, be prepared for minor delays. Leaving early or finding an alternative route can help save time."
}