{
  "summary_reco": " Today: With a high volume of vehicles, seek alternative routes to avoid congestion.\n\nThis week: Anticipate heavy traffic, consider adjusting travel schedules or finding alternate routes.\n\nThree months: High vehicle volume is expected throughout this period. Plan and test alternative routes in advance to save time and fuel.",
  "hourly_reco": " Peak Hour:\nDuring peak hour on C-4 Road, expect higher traffic due to 167 vehicles. To avoid delays, consider alternative routes or start your journey earlier than usual.\n\nLowest Hour:\nAlthough there is less traffic during the lowest hour with 132 vehicles, conditions can still be moderate. If possible, use this time to travel if you prefer fewer vehicles on the road.\n\nAverage Vehicles:\nWith an average of 153 vehicles on C-4 Road, traffic conditions remain moderate throughout the day. Stay informed about the current traffic situation and consider alternative routes during peak hours to optimize your travel time.",
  "daily_reco": " Peak Day:\n- Consider using alternative routes or modes of transportation, such as public transportation or biking, to avoid congestion on C-4 Road.\n\nLowest Day:\n- Although there's likely to be less congestion on C-4 Road, still be prepared for some traffic and allow for extra travel time.\n\nAverage Vehicles per Day:\n- It's still a good idea to consider alternative routes or modes of transportation on most days to avoid potential traffic build-up on C-4 Road.",
  "weekly_reco": " Peak Week:\nTo avoid congestion during peak week, consider carpooling or using public transportation on C-4 Road. Alternatively, you can also plan to travel during off-peak hours.\n\nLowest Week:\nEven during the lowest week, C-4 Road can still be congested. To ensure a smooth commute, consider leaving early for your destination.\n\nAverage Vehicles per Week:\nTo avoid congestion, consider using alternative routes or modes of transportation, such as cycling or walking, if feasible. If you must use C-4 Road, try to travel during off-peak hours or use real-time traffic information to plan your route.",
  "monthly_reco": " Peak: With high traffic expected, consider alternative routes or plan your journey during off-peak hours to ensure a smoother commute.\n\nLowest: Despite fewer vehicles, unpredictable factors like construction or accidents can still cause delays. Stay informed through real-time traffic updates and have backup plans ready.\n\nAverage: With consistent traffic, prioritize leaving with extra travel time, maintaining vehicle readiness, and following traffic rules to ensure safety and punctuality."
}